const NewsDatabase = [{
    id: 1, preview: "style/VanTube News Preview.png", headers: "У VanTube появился свой официальный сайт", text: `<p>У VanTube появилась страница с новостями.</p>
                            <p>Теперь вы можете узнать об нововведениях и обновлениях VanTube в любое время.</p>
                            <p></p>
                            <p></p>`, data: "14.02.2026"
},
{
    id: 2, preview: "style/VanTube News Preview.png", headers: "У сайта VanTube появилась страница с новостями", text: `<p>У VanTube появилась страница с новостями.</p>
    <p>Теперь вы можете узнать об нововведениях и обновлениях VanTube в любое время.</p>
    <p></p>
    <p></p>`, data: "20.02.2026"
},
{
    id: 3, preview: "style/VanTube News Preview 2.png", headers: "VanTube больше не будет получать обновления на Классике", text: `<p>VanTube перестанет обновлятся на версиях браузера "Козел" для Shindows SG Classic начиная с 1 марта 2026 года. Это связано с тем что поддержка Shindows SG Classic закончилась. Также это связано с тем что в ближайшем будущем сертификаты безопасности на версиях "Козла" для Shindows SG Classic станут устаревшими.</p>
    <p>Но несмотря на это пользователи смогут смотреть видео на VanTube и пользоваться режимом разработчика. Однако мы рекомендуем перейти на поддерживаемые версии Shindows SG, так пользоваться VanTube на Shindows SG Classic небезопасно (и Shindows может поломаться)</p>
    <p></p>
    <p></p>`, data: "22.02.2026"
},
{
    id: 4, preview: "style/VanTube News Preview 3.png", headers: "У VanTube теперь есть канал в VK", text: `<p><p>Теперь вы можете смотреть наши видео и выкладывать свои в нашем ВК канале.</p>
    <p>В скором времени на платформе ВК также появятся наши сервисы VanTube Music и VanTube Short.</p>
    <p>Следите и узнавайте за нами в новостях на нашем сайте.</p>
    <p></p>`, data: "07.03.2026"
},
{
    id: 5, preview: "style/VanTube News Preview 4.png", headers: "У TG VanTube день рождения, нам 1 год", text: `<p>15 марта ТГ каналу VanTube будет 1 год. За это время сервис получил множество обновлений и нововведений.</p>
    <p>Все начиналось с того, что был создан на то время ещё малоизвестный канал нашего видеосервиса, 
     который позволил бы привлечь создателей конента на новую платформу. Уже после появился бот, 
     который позволил авторам контента без доступа админа-контентмейкера вылаживать видео на VanTube (пускай с проверкой видео главами платформы). 
     В будущем по блату множество контент-мейкеров получили доступ к публикации видео на платформе без использования бота 
     ,что значительно увеличило количество видео на платформе. </p>
    <p>После этого платформа активно развивалась, вышло множество обновлений связанных с появлением новых форматов видео и новых приложений VanTube - VanTube Short и Music. </p>
    <p>Мы активно продолжаем обновлять сервис и привлекать множество людей к созданию творчества на платформе. И в честь ДР мы подготовили подарок к дню рождения. А именно: бесплатный доступ к VanTube Premium на время, получение прав админа контент-мейкера на всех платформах VanTube в ТГ и ВК.</p>
    <p>Для того чтобы все это получить вам нужно присоединится к розыгрышу в нашем офиц тг канале (количество победителей будет большое).</p>
    <p>Огромное спасибо вам за использование нашей платформы</p>`, data: "14.03.2026"
},
{
    id: 6, preview: "style/VanTube News Preview 5.png", headers: "Официальная Блокировка ТГ в России, что делать?", text: `<p>1 апреля 2026 года свершилась окончательная блокировка Telegram в РФ. Для многих людей, в том числе и пользователей VanTube TG это является большой проблемой.</p>
    <p>Первое что мы можем посоветовать пользователям нашего проекта - перейти в наш канал в <a href="https://vk.ru/club236356285">VK</a> 
       или в наш чат в мессенджере <a href="https://kozlyatnik.fwh.is/?i=1">Козлятнике</a> (чтобы найти его напишите в поиске чатов "VanTube") </p>
    <p>Либо же вы можете использовать различные способы обхода блокировок (по типу VPN или прокси, который можно активировать прямо в самом ТГ)</p>
    <p>Эти советы позволят вам оставаться на связи в наеш непростое время</p>
    <p></p>
    <p></p>`, data: "01.04.2026"
},
{
    id: 7, preview: "style/VanTube News Preview 6.png", headers: "У VanTube появится собственный API!", text: `<p>VanTube теперь выпускает свое API 🎉. Этот API позволит публиковать видео на VanTube без использования сервиса VanTube TG. </p>
    <p>На данный момент этот продукт находится на стадии тестирования, но разработчики VanTube уже активно работают над его созданием. </p>
    <p>Поэтому в ближайшее время VanTube API может стать доступным для общедоступного использования.</p>
    <p>Однако вы по прежнему сможете использовать сервис VanTube TG для публикации своего творчества.</p>
    <p></p>
    <p></p>`, data: "08.04.2026"
},
{
    id: 8, preview: "style/VanTube News Preview.png", headers: "Обновление VanTube, добавление дата-базы сайта", text: `<p> У VanTube наконец-то появилась база данных на базе JavaScript. </p>
    <p>Это позволит сделать наш сайт более функциональным и динамическим, что облегчит: работу над созданием новых новостей, поиск информации на сайте и т.д . В будущем мы планируем добавить множество новых функций на сайте (в том числе и API для загрузки видео)</p>
    <p>Мы очень надеемся, что это изменение порадует пользователей VanTube.</p>
    <p></p>
    <p></p>`, data: "08.04.2026"
}];
const PageDatabase = [];
const VideoDatabase = [];